{"nalfeshnee": {"name": "Nalfeshnee", "size": "Large", "type": "fiend", "subtype": "demon", "armor_class": 18, "hit_points": 184, "speed": {"walk": "20 ft.", "fly": "30 ft."}, "strength": 21, "dexterity": 10, "constitution": 22, "intelligence": 19, "wisdom": 12, "charisma": 15, "damage_resistances": ["cold", "fire", "lightning", "bludgeoning, piercing, and slashing from nonmagical weapons"], "damage_immunities": ["poison"], "condition_immunities": [{"name": "Poisoned", "url": "/api/conditions/poisoned"}], "challenge_rating": 13, "special_abilities": [{"name": "Magic Resistance", "desc": "The nalfeshnee has advantage on saving throws against spells and other magical effects."}], "actions": [{"name": "Multiattack", "desc": "The nalfeshnee uses Horror Nimbus if it can.  It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 32 (5d10 + 5) piercing damage.", "attack_bonus": 10, "damage": [{"damage_type": {"name": "Piercing", "url": "/api/damage-types/piercing"}, "damage_dice": "5d10", "damage_bonus": 5}]}, {"name": "Claw", "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 15 (3d6 + 5) slashing damage.", "attack_bonus": 10, "damage": [{"damage_type": {"name": "Slashing", "url": "/api/damage-types/slashing"}, "damage_dice": "3d6", "damage_bonus": 5}]}, {"name": "Horror Nimbus", "desc": "The nalfeshnee magically emits scintillating, multicolored light. Each creature within 15 feet of the nalfeshnee that can see the light must succeed on a DC 15 Wisdom saving throw or be frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the nalfeshnee's Horror Nimbus for the next 24 hours.", "usage": {"type": "recharge on roll", "dice": "1d6", "min_value": 5}, "dc": {"dc_type": {"name": "WIS", "url": "/api/ability-scores/wis"}, "dc_value": 15, "success_type": "none"}}, {"name": "Teleport", "desc": "The nalfeshnee magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see."}, {"name": "Variant: Summon Demon", "desc": "The demon chooses what to summon and attempts a magical summoning.\nA nalfeshnee has a 50 percent chance of summoning 1d4 vrocks, 1d3 hezrous, 1d2 glabrezus, or one nalfeshnee.\nA summoned demon appears in an unoccupied space within 60 feet of its summoner, acts as an ally of its summoner, and can't summon other demons. It remains for 1 minute, until it or its summoner dies, or until its summoner dismisses it as an action.", "usage": {"type": "per day", "times": 1}}]}, "night-hag": {"name": "Night Hag", "size": "Medium", "type": "fiend", "subtype": null, "armor_class": 17, "hit_points": 112, "speed": {"walk": "30 ft."}, "strength": 18, "dexterity": 15, "constitution": 16, "intelligence": 16, "wisdom": 14, "charisma": 16, "damage_resistances": ["cold", "fire", "bludgeoning, piercing, and slashing from nonmagical weapons that aren't silvered"], "damage_immunities": [], "condition_immunities": [{"name": "Charmed", "url": "/api/conditions/charmed"}], "challenge_rating": 5, "special_abilities": [{"name": "Innate Spellcasting", "desc": "The hag's innate spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). She can innately cast the following spells, requiring no material components:\n\nAt will: detect magic, magic missile\n2/day each: plane shift (self only), ray of enfeeblement, sleep", "spellcasting": {"ability": {"name": "CHA", "url": "/api/ability-scores/cha"}, "dc": 14, "modifier": 6, "components_required": [], "spells": [{"name": "Detect Magic", "url": "/api/spells/detect-magic", "usage": {"type": "at will"}}, {"name": "Magic Missile", "url": "/api/spells/magic-missile", "usage": {"type": "at will"}}, {"name": "Plane Shift", "notes": "Self Only", "url": "/api/spells/plane-shift", "usage": {"type": "per day", "times": 2}}, {"name": "Ray of Enfeeblement", "url": "/api/spells/ray-of-enfeeblement", "usage": {"type": "per day", "times": 2}}, {"name": "Sleep", "url": "/api/spells/sleep", "usage": {"type": "per day", "times": 2}}]}}, {"name": "Magic Resistance", "desc": "The hag has advantage on saving throws against spells and other magical effects."}, {"name": "Night Hag Items", "desc": "A night hag carries two very rare magic items that she must craft for herself If either object is lost, the night hag will go to great lengths to retrieve it, as creating a new tool takes time and effort.\nHeartstone: This lustrous black gem allows a night hag to become ethereal while it is in her possession. The touch of a heartstone also cures any disease. Crafting a heartstone takes 30 days.\nSoul Bag: When an evil humanoid dies as a result of a night hag's Nightmare Haunting, the hag catches the soul in this black sack made of stitched flesh. A soul bag can hold only one evil soul at a time, and only the night hag who crafted the bag can catch a soul with it. Crafting a soul bag takes 7 days and a humanoid sacrifice (whose flesh is used to make the bag)."}, {"name": "Hag Coven", "desc": "When hags must work together, they form covens, in spite of their selfish natures. A coven is made up of hags of any type, all of whom are equals within the group. However, each of the hags continues to desire more personal power.\nA coven consists of three hags so that any arguments between two hags can be settled by the third. If more than three hags ever come together, as might happen if two covens come into conflict, the result is usually chaos."}, {"name": "Shared Spellcasting (Coven Only)", "desc": "While all three members of a hag coven are within 30 feet of one another, they can each cast the following spells from the wizard's spell list but must share the spell slots among themselves:\n\n- 1st level (4 slots): identify, ray of sickness\n- 2nd level (3 slots): hold person, locate object\n- 3rd level (3 slots): bestow curse, counterspell, lightning bolt\n- 4th level (3 slots): phantasmal killer, polymorph\n- 5th level (2 slots): contact other plane, scrying\n- 6th level (1 slot): eye bite\n\nFor casting these spells, each hag is a 12th-level spellcaster that uses Intelligence as her spellcasting ability. The spell save DC is 12+the hag's Intelligence modifier, and the spell attack bonus is 4+the hag's Intelligence modifier."}, {"name": "Hag Eye (Coven Only)", "desc": "A hag coven can craft a magic item called a hag eye, which is made from a real eye coated in varnish and often fitted to a pendant or other wearable item. The hag eye is usually entrusted to a minion for safekeeping and transport. A hag in the coven can take an action to see what the hag eye sees if the hag eye is on the same plane of existence. A hag eye has AC 10, 1 hit point, and darkvision with a radius of 60 feet. If it is destroyed, each coven member takes 3d10 psychic damage and is blinded for 24 hours.\nA hag coven can have only one hag eye at a time, and creating a new one requires all three members of the coven to perform a ritual. The ritual takes 1 hour, and the hags can't perform it while blinded. During the ritual, if the hags take any action other than performing the ritual, they must start over."}], "actions": [{"name": "Claws (Hag Form Only)", "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage.", "attack_bonus": 7, "damage": [{"damage_type": {"name": "Slashing", "url": "/api/damage-types/slashing"}, "damage_dice": "2d8", "damage_bonus": 4}]}, {"name": "Change Shape", "desc": "The hag magically polymorphs into a Small or Medium female humanoid, or back into her true form. Her statistics are the same in each form. Any equipment she is wearing or carrying isn't transformed. She reverts to her true form if she dies."}, {"name": "Etherealness", "desc": "The hag magically enters the Ethereal Plane from the Material Plane, or vice versa. To do so, the hag must have a heartstone in her possession."}, {"name": "Nightmare Haunting", "desc": "While on the Ethereal Plane, the hag magically touches a sleeping humanoid on the Material Plane. A protection from evil and good spell cast on the target prevents this contact, as does a magic circle. As long as the contact persists, the target has dreadful visions. If these visions last for at least 1 hour, the target gains no benefit from its rest, and its hit point maximum is reduced by 5 (1d10). If this effect reduces the target's hit point maximum to 0, the target dies, and if the target was evil, its soul is trapped in the hag's soul bag. The reduction to the target's hit point maximum lasts until removed by the greater restoration spell or similar magic.", "usage": {"type": "per day", "times": 1}}]}, "nightmare": {"name": "Nightmare", "size": "Large", "type": "fiend", "subtype": null, "armor_class": 13, "hit_points": 68, "speed": {"walk": "60 ft.", "fly": "90 ft."}, "strength": 18, "dexterity": 15, "constitution": 16, "intelligence": 10, "wisdom": 13, "charisma": 15, "damage_resistances": [], "damage_immunities": ["fire"], "condition_immunities": [], "challenge_rating": 3, "special_abilities": [{"name": "Confer Fire Resistance", "desc": "The nightmare can grant resistance to fire damage to anyone riding it."}, {"name": "Illumination", "desc": "The nightmare sheds bright light in a 10-foot radius and dim light for an additional 10 feet."}], "actions": [{"name": "Hooves", "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage plus 7 (2d6) fire damage.", "attack_bonus": 6, "damage": [{"damage_type": {"name": "Bludgeoning", "url": "/api/damage-types/bludgeoning"}, "damage_dice": "2d8", "damage_bonus": 4}, {"damage_type": {"name": "Fire", "url": "/api/damage-types/fire"}, "damage_dice": "2d6", "damage_bonus": 0}]}, {"name": "Ethereal Stride", "desc": "The nightmare and up to three willing creatures within 5 feet of it magically enter the Ethereal Plane from the Material Plane, or vice versa."}]}, "noble": {"name": "Noble", "size": "Medium", "type": "humanoid", "subtype": "any race", "armor_class": 15, "hit_points": 9, "speed": {"walk": "30 ft."}, "strength": 11, "dexterity": 12, "constitution": 11, "intelligence": 12, "wisdom": 14, "charisma": 16, "damage_resistances": [], "damage_immunities": [], "condition_immunities": [], "challenge_rating": 0.125, "actions": [{"name": "Rapier", "desc": "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. Hit: 5 (1d8 + 1) piercing damage.", "attack_bonus": 3, "damage": [{"damage_type": {"name": "Bludgeoning", "url": "/api/damage-types/bludgeoning"}, "damage_dice": "1d8", "damage_bonus": 1}]}]}}