{"gaseous-form": {"name": "Gaseous Form", "desc": ["You transform a willing creature you touch, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn't affected.", "While in this form, the target's only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target has resistance to nonmagical damage, and it has advantage on Strength, Dexterity, and constitution saving throws. The target can pass through small holes, narrow openings, and even mere cracks, though it treats liquids as though they were solid surfaces. The target can't fall and remains hovering in the air even when stunned or otherwise incapacitated.", "While in the form of a misty cloud, the target can't talk or manipulate objects, and any objects it was carrying or holding can't be dropped, used, or otherwise interacted with. The target can't attack or cast spells."], "range": "Touch", "duration": "Up to 1 hour", "casting_time": "1 action"}, "gate": {"name": "Gate", "desc": ["You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration.", "The portal has a front and a back on each plane where it appears. Travel through the portal is possible only by moving through its front. Anything that does so is instantly transported to the other plane, appearing in the unoccupied space nearest to the portal.", "Deities and other planar rulers can prevent portals created by this spell from opening in their presence or anywhere within their domains.", "When you cast this spell, you can speak the name of a specific creature (a pseudonym, title, or nickname doesn't work). If that creature is on a plane other than the one you are on, the portal opens in the named creature's immediate vicinity and draws the creature through it to the nearest unoccupied space on your side of the portal. You gain no special power over the creature, and it is free to act as the DM deems appropriate. It might leave, attack you, or help you."], "range": "60 feet", "duration": "Up to 1 minute", "casting_time": "1 action"}, "geas": {"name": "Geas", "desc": ["You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide. If the creature can understand you, it must succeed on a wisdom saving throw or become charmed by you for the duration. While the creature is charmed by you, it takes 5d10 psychic damage each time it acts in a manner directly counter to your instructions, but no more than once each day. A creature that can't understand you is unaffected by the spell.", "You can issue any command you choose, short of an activity that would result in certain death. Should you issue a suicidal command, the spell ends.", "You can end the spell early by using an action to dismiss it. A remove curse, greater restoration, or wish spell also ends it."], "higher_level": ["When you cast this spell using a spell slot of 7th or 8th level, the duration is 1 year. When you cast this spell using a spell slot of 9th level, the spell lasts until it is ended by one of the spells mentioned above."], "range": "60 feet", "duration": "30 days", "casting_time": "1 minute"}, "gentle-repose": {"name": "Gentle Repose", "desc": ["You touch a corpse or other remains. For the duration, the target is protected from decay and can't become undead.", "The spell also effectively extends the time limit on raising the target from the dead, since days spent under the influence of this spell don't count against the time limit of spells such as raise dead."], "range": "Touch", "duration": "10 days", "casting_time": "1 action"}, "giant-insect": {"name": "Giant Insect", "desc": ["You transform up to ten centipedes, three spiders, five wasps, or one scorpion within range into giant versions of their natural forms for the duration. A centipede becomes a giant centipede, a spider becomes a giant spider, a wasp becomes a giant wasp, and a scorpion becomes a giant scorpion.", "Each creature obeys your verbal commands, and in combat, they act on your turn each round. The DM has the statistics for these creatures and resolves their actions and movement.", "A creature remains in its giant size for the duration, until it drops to 0 hit points, or until you use an action to dismiss the effect on it.", "The DM might allow you to choose different targets. For example, if you transform a bee, its giant version might have the same statistics as a giant wasp."], "range": "30 feet", "duration": "Up to 10 minutes", "casting_time": "1 action"}, "glibness": {"name": "Glibness", "desc": ["Until the spell ends, when you make a Charisma check, you can replace the number you roll with a 15. Additionally, no matter what you say, magic that would determine if you are telling the truth indicates that you are being truthful."], "range": "Self", "duration": "1 hour", "casting_time": "1 action"}, "globe-of-invulnerability": {"name": "Globe of Invulnerability", "desc": ["An immobile, faintly shimmering barrier springs into existence in a 10-foot radius around you and remains for the duration.", "Any spell of 5th level or lower cast from outside the barrier can't affect creatures or objects within it, even if the spell is cast using a higher level spell slot. Such a spell can target creatures and objects within the barrier, but the spell has no effect on them. Similarly, the area within the barrier is excluded from the areas affected by such spells."], "higher_level": ["When you cast this spell using a spell slot of 7th level or higher, the barrier blocks spells of one level higher for each slot level above 6th."], "range": "Self", "duration": "Up to 1 minute", "casting_time": "1 action"}, "glyph-of-warding": {"name": "Glyph of Warding", "desc": ["When you cast this spell, you enter a glyph that hurt other creatures, either on a surface (like a table or a portion of a floor or wall) or inside an object that can be closed (like a book a parchment or cabinet) to hide the glyph. If you opt for a surface, the glyph can cover an area of 10 feet or less in diameter. If you select an object, it must remain in place. If the object is moved to over 10 feet from where the spell was spell casts, the glyph breeze and the spell expires without being triggered.", "The glyph is virtually invisible and roll Intelligence (Investigation) against the fate of your save DC is required to find out.", "You determine the shutter glyph while casting the spell. For the glyphs inscribed on a surface, the triggers are typically hit or stand on a glyph remove an object placed on the glyph, approach at a certain distance of the glyph or manipulate an object on which is inscribed the glyph. For the glyphs inscribed in an object, triggers are typically open the object, approaching at a distance from the object, seen or read the glyph. Once the glyph is triggered, the spell ends.", "You can refine the trigger conditions so that the spell will work only in certain circumstances or in physical attributes (height or weight), the creature type (eg, only aberrations or the Dark Elves trigger the glyph) or alignment. You can also determine the conditions for certain creatures do not trigger the glyph, using a password, for example.", "When you sign the glyph, make a choice between the explosive runes or glyph fate.", "Explosive runes.", " When triggered, magical energy springs from the glyph in a 20-foot-radius sphere centered on the glyph. The sphere bypasses the corners. Each creature in the area must make a dexterity saving throw or it suffers 5d8 acid damage, lightning, fire, cold or thunder (to be determined during the creation of the glyph). If successful, the damage is halved.", "Sort glyph.", " You can store a level of 3 or less prepared spell in the glyph to chant during the creation of the glyph. The spell must target one creature or area. The stored spell has no immediate effect when spell casts that way. When the glyph is activated, the stored spell spell casts. If the spell is a target, it will target the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell invokes hostile creatures or creates sharp objects or traps, they also appear close as possible to the intruder and attack. If the spell requires concentration, it persists for the duration of the spell."], "higher_level": ["When you cast this spell using a 4 or higher is level, the damage explosive runes increased by 1d8 for each level of top slot 3. If you create a glyph spell, you may store a spell whose level is equivalent or less to spell slot used for the custody of the glyph."], "range": "Touch", "duration": "Until dispelled", "casting_time": "1 hour"}, "goodberry": {"name": "Goodberry", "desc": ["Up to ten berries appear in your hand and are infused with magic for the duration. A creature can use its action to eat one berry. Eating a berry restores 1 hit point, and the berry provides enough nourishment to sustain a creature for a day.", "The berries lose their potency if they have not been consumed within 24 hours of the casting of this spell."], "range": "Touch", "duration": "Instantaneous", "casting_time": "1 action"}, "grease": {"name": "Grease", "desc": ["Slick grease covers the ground in a 10-foot square centered on a point within range and turns it into difficult terrain for the duration.", "When the grease appears, each creature standing in its area must succeed on a dexterity saving throw or fall prone. A creature that enters the area or ends its turn there must also succeed on a dexterity saving throw or fall prone."], "range": "60 feet", "duration": "1 minute", "casting_time": "1 action"}, "greater-invisibility": {"name": "Greater Invisibility", "desc": ["You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person."], "range": "Touch", "duration": "Up to 1 minute", "casting_time": "1 action"}, "greater-restoration": {"name": "Greater Restoration", "desc": ["You imbue a creature you touch with positive energy to undo a debilitating effect. You can reduce the target's exhaustion level by one, or end one of the following effects on the target:", "- One effect that charmed or petrified the target", "- One curse, including the target's attunement to a cursed magic item", "- Any reduction to one of the target's ability scores", "- One effect reducing the target's hit point maximum"], "range": "Touch", "duration": "Instantaneous", "casting_time": "1 action"}, "guardian-of-faith": {"name": "Guardian of Faith", "desc": ["A Large spectral guardian appears and hovers for the duration in an unoccupied space of your choice that you can see within range. The guardian occupies that space and is indistinct except for a gleaming sword and shield emblazoned with the symbol of your deity.", "Any creature hostile to you that moves to a space within 10 feet of the guardian for the first time on a turn must succeed on a dexterity saving throw. The creature takes 20 radiant damage on a failed save, or half as much damage on a successful one. The guardian vanishes when it has dealt a total of 60 damage."], "range": "30 feet", "duration": "8 hours", "casting_time": "1 action"}, "guards-and-wards": {"name": "Guards and Wards", "desc": ["You create a ward that protects up to 2,500 square feet of floor space (an area 50 feet square, or one hundred 5-foot squares or twenty-five 10-foot squares). The warded area can be up to 20 feet tall, and shaped as you desire. You can ward several stories of a stronghold by dividing the area among them, as long as you can walk into each contiguous area while you are casting the spell.", "When you cast this spell, you can specify individuals that are unaffected by any or all of the effects that you choose. You can also specify a password that, when spoken aloud, makes the speaker immune to these effects.", "Guards and wards creates the following effects within the warded area.", "Corridors.", " Fog fills all the warded corridors, making them heavily obscured. In addition, at each intersection or branching passage offering a choice of direction, there is a 50 percent chance that a creature other than you will believe it is going in the opposite direction from the one it chooses.", "Doors.", " All doors in the warded area are magically locked, as if sealed by an arcane lock spell. In addition, you can cover up to ten doors with an illusion (equivalent to the illusory object function of the minor illusion spell) to make them appear as plain sections of wall.", "Stairs.", " Webs fill all stairs in the warded area from top to bottom, as the web spell. These strands regrow in 10 minutes if they are burned or torn away while guards and wards lasts.", "Other Spell Effect.", " You can place your choice of one of the following magical effects within the warded area of the stronghold.", "- Place dancing lights in four corridors. You can design nate a simple program that the lights repeat as long as guards and wards lasts.", "- Place magic mouth in two locations.", "- Place stinking cloud in two locations. The vapors appear in the places you designate; they return within 10 minutes if dispersed by wind while guards and wards lasts.", "- Place a constant gust of wind in one corridor or room.", "- Place a suggestion in one location. You select an area of up to 5 feet square, and any creature that enters or passes through the area receives the suggestion mentally.", "The whole warded area radiates magic. A dispel magic cast on a specific effect, if successful, removes only that effect.", "You can create a permanently guarded and warded structure by casting this spell there every day for one year."], "range": "Touch", "duration": "24 hours", "casting_time": "10 minutes"}, "guidance": {"name": "Guidance", "desc": ["You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends."], "range": "Touch", "duration": "Up to 1 minute", "casting_time": "1 action"}, "guiding-bolt": {"name": "Guiding Bolt", "desc": ["A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then."], "higher_level": ["When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."], "range": "120 feet", "duration": "1 round", "casting_time": "1 action"}, "gust-of-wind": {"name": "Gust of Wind", "desc": ["A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell's duration. Each creature that starts its turn in the line must succeed on a strength saving throw or be pushed 15 feet away from you in a direction following the line.", "Any creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you.", "The gust disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them.", "As a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you."], "range": "Self", "duration": "Up to 1 minute", "casting_time": "1 action"}}