{"earthquake": {"name": "Earthquake", "desc": ["You create a seismic disturbance at a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area.", "The ground in the area becomes difficult terrain. Each creature on the ground that is concentrating must make a constitution saving throw. On a failed save, the creature's concentration is broken.", "When you cast this spell and at the end of each turn you spend concentrating on it, each creature on the ground in the area must make a dexterity saving throw. On a failed save, the creature is knocked prone.", "This spell can have additional effects depending on the terrain in the area, as determined by the DM.", "Fissures. Fissures open throughout the spell's area at the start of your next turn after you cast the spell. A total of 1d6 such fissures open in locations chosen by the DM. Each is 1d10 x 10 feet deep, 10 feet wide, and extends from one edge of the spell's area to the opposite side. A creature standing on a spot where a fissure opens must succeed on a dexterity saving throw or fall in. A creature that successfully saves moves with the fissure's edge as it opens.", "A fissure that opens beneath a structure causes it to automatically collapse (see below).", "Structures. The tremor deals 50 bludgeoning damage to any structure in contact with the ground in the area when you cast the spell and at the start of each of your turns until the spell ends. If a structure drops to 0 hit points, it collapses and potentially damages nearby creatures. A creature within half the distance of a structure's height must make a dexterity saving throw. On a failed save, the creature takes 5d6 bludgeoning damage, is knocked prone, and is buried in the rubble, requiring a DC 20 Strength (Athletics) check as an action to escape. The DM can adjust the DC higher or lower, depending on the nature of the rubble. On a successful save, the creature takes half as much damage and doesn't fall prone or become buried."], "range": "500 feet", "duration": "Up to 1 minute", "casting_time": "1 action"}, "eldritch-blast": {"name": "Eldritch Blast", "desc": ["A beam of crackling energy streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 force damage."], "higher_level": ["The spell creates more than one beam when you reach higher levels: two beams at 5th level, three beams at 11th level, and four beams at 17th level. You can direct the beams at the same target or at different ones. Make a separate attack roll for each beam."], "range": "120 feet", "duration": "Instantaneous", "casting_time": "1 action"}, "enhance-ability": {"name": "Enhance Ability", "desc": ["You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains that effect until the spell ends.", "Bear's Endurance.", " The target has advantage on constitution checks. It also gains 2d6 temporary hit points, which are lost when the spell ends.", "Bull's Strength.", " The target has advantage on strength checks, and his or her carrying capacity doubles.", "Cat's Grace.", " The target has advantage on dexterity checks. It also doesn't take damage from falling 20 feet or less if it isn't incapacitated.", "Eagle's Splendor.", " The target has advantage on Charisma checks.", "Fox's Cunning.", " The target has advantage on intelligence checks.", "Owl's Wisdom.", " The target has advantage on wisdom checks."], "higher_level": ["When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."], "range": "Touch", "duration": "Up to 1 hour", "casting_time": "1 action"}, "enlarge-reduce": {"name": "Enlarge/Reduce", "desc": ["Enlarging or reducing in size a creature or object that you can see and is within range for the duration of the spell. Choose a creature or object that is not worn or carried. If the target does not consent, it can make a constitution saving throw. If successful, the spell has no effect.", "If the target is a creature, everything she wears and carries with it change size. Any item dropped by the affected creature returns to its normal size.", "Magnification.", " The double target in all dimensions, and its weight is multiplied by eight. This increases the size of a class of M to G for example. If there is not enough space in the room for the double target size, the creature or object reaches the maximum size possible in the available space. Until the end of the spell, the target also has the advantage of its jets Force and Force saves. Weapons to the target also grow. As long as these weapons are enlarged, the target's attacks cause additional 1d4 damage.", "Reduction.", " The size of the target is reduced by half in all dimensions, and its weight is divided by eight. This reduction decreases the size of a class from M to P for example. Until the end of the spell, the target has a disadvantage to its jets Force and its Force saves. The weapons of the target shrink too. As long as these weapons are reduced, target attacks cause less damage 1d4 (minimum 1 point of damage)."], "range": "30 feet", "duration": "Up to 1 minute", "casting_time": "1 action"}, "entangle": {"name": "Entangle", "desc": ["Grasping weeds and vines sprout from the ground in a 20-foot square starting form a point within range. For the duration, these plants turn the ground in the area into difficult terrain.", "A creature in the area when you cast the spell must succeed on a strength saving throw or be restrained by the entangling plants until the spell ends. A creature restrained by the plants can use its action to make a Strength check against your spell save DC. On a success, it frees itself.", "When the spell ends, the conjured plants wilt away."], "range": "90 feet", "duration": "Up to 1 minute", "casting_time": "1 action"}, "enthrall": {"name": "Enthrall", "desc": ["You weave a distracting string of words, causing creatures of your choice that you can see within range and that can hear you to make a wisdom saving throw. Any creature that can't be charmed succeeds on this saving throw automatically, and if you or your companions are fighting a creature, it has advantage on the save. On a failed save, the target has disadvantage on Wisdom (Perception) checks made to perceive any creature other than you until the spell ends or until the target can no longer hear you. The spell ends if you are incapacitated or can no longer speak."], "range": "60 feet", "duration": "1 minute", "casting_time": "1 action"}, "etherealness": {"name": "Etherealness", "desc": ["You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can't see anything more than 60 feet away.", "While on the Ethereal Plane, you can only affect and be affected by other creatures on that plane. Creatures that aren't on the Ethereal Plane can't perceive you and can't interact with you, unless a special ability or magic has given them the ability to do so.", "You ignore all objects and effects that aren't on the Ethereal Plane, allowing you to move through objects you perceive on the plane you originated from.", "When the spell ends, you immediately return to the plane you originated from in the spot you currently occupy. If you occupy the same spot as a solid object or creature when this happens, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you are moved.", "This spell has no effect if you cast it while you are on the Ethereal Plane or a plane that doesn't border it, such as one of the Outer Planes."], "higher_level": ["When you cast this spell using a spell slot of 8th level or higher, you can target up to three willing creatures (including you) for each slot level above 7th. The creatures must be within 10 feet of you when you cast the spell."], "range": "Self", "duration": "8 hours", "casting_time": "1 action"}, "expeditious-retreat": {"name": "Expeditious Retreat", "desc": ["This spell allows you to move at an incredible pace. When you cast this spell, and then as a bonus action on each of your turns until the spell ends, you can take the Dash action."], "range": "Self", "duration": "Up to 10 minutes", "casting_time": "1 bonus action"}, "eyebite": {"name": "Eyebite", "desc": ["For the spell's duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can't target a creature again if it has succeeded on a saving throw against this casting of eyebite.", "Asleep.", " The target falls unconscious. It wakes up if it takes any damage or if another creature uses its action to shake the sleeper awake.", "Panicked.", " The target is frightened of you. On each of its turns, the frightened creature must take the Dash action and move away from you by the safest and shortest available route, unless there is nowhere to move. If the target moves to a place at least 60 feet away from you where it can no longer see you, this effect ends.", "Sickened.", " The target has disadvantage on attack rolls and ability checks. At the end of each of its turns, it can make another wisdom saving throw. If it succeeds, the effect ends."], "range": "Self", "duration": "Up to 1 minute", "casting_time": "1 action"}}